<?php
$_['text_error_num']                = 'الحقل %s يجب أن تكون قيمتة رقمية';
$_['text_error_int']                = 'الحقل %s يجب أن تكون قيمتة رقمم صحيح';
$_['text_error_float']              = 'الحقل %s يجب أن تكون قيمتة رقم عشري';
$_['text_error_floatLike']          = 'الحقل %s يجب أن تكون قيمتة رقم عشري بين ( %s و %s )';
$_['text_error_alpha']              = 'الحقل %s يجب أن تكون قيمتة أحرف فقط';
$_['text_error_alpha_num']          = 'الحقل %s يجب أن تكون قيمتة أحرف فقط ( ان كان نصيا )';
$_['text_error_v_date']             = 'الحقل %s يجب أن تكون قيمته في شكل تاريخ مثال (YYYY-MM-DD)';
$_['text_error_email']              = 'الحقل %s يجب أن تكون قيمتة بريدا الكترونيا مثال (m@m.com)';
$_['text_error_url']                = 'الحقل %s يجب أن تكون قيمتة عباره عن رابط مثال (http://www.m.com)';
$_['text_error_required']           = 'الحقل %s يجب أن يحتوي علي قيمة';
$_['text_error_equal']              = 'الحقل %s يجب أن تكون قيمتة مساوية ل %s';
$_['text_error_equal_field']        = 'الحقل %s يجب أن تكون قيمتة مساوية ل %s';
$_['text_error_less']               = 'الحقل %s يجب أن تكون قيمته أقل من %s';
$_['text_error_greater']            = 'الحقل %s يجب أن تكون قيمته أكثر من %s';
$_['text_error_min']                = 'الحقل %s يجب أن تكون قيمتة علي الأقل %s ( أن كان نصيا )';
$_['text_error_max']                = 'الحقل %s يجب أن تكون قيمتة علي الأكثر %s ( أن كان نصيا )';
$_['text_error_between']            = 'الحقل %s يجب أن تكون قيمتة ما بين %s و %s';